emacs_setup.org
#+TITLE: Paf's portable Emacs configuration
#+AUTHOR: Pascal Fleury
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+roam_tags: project todo

This is my Emacs config. You need to tangle this into a file that then gets loaded by Emacs: =C-c C-v t= [org-babel-tangle]. Below, I also explain how this tangling is automated.

Find extensive documentation about how to do this [[https://github.com/larstvei/dot-emacs][here]].

* Personal Plans
I regularly try out new packages, this is my current list of things being evaluated.
They usually live temporarily in my =~/.emacs= until I am happy, in which case I move their config into this file so that it gets replicated on all machines I work on with Emacs.

** Currently under review
  - [[https://github.com/Kungsgeten/yankpad][yankpad]]
  - [[https://github.com/yjwen/org-reveal][ox-reveal]] (see [[https://github.com/yjwen/org-reveal#set-the-location-of-revealjs][installation]])

** Make the config work fine when initially installed
*** TODO F12 does not find any files
:LOGBOOK:
- State "TODO"       from              [2021-02-03 Wed 16:52]
:END:
because nothing is set in the =org-agenda-files=
*** TODO maybe complain when org-directory is not set t an existing directory
:LOGBOOK:
- State "TODO"       from              [2021-02-03 Wed 16:53]
:

* One-time Initial Setup
I have my config in directory =~/Emacs= which is where I clone this repository. The config setup is maintained purely in the =~/Emacs/emacs_setup.org= file.

In your =~/.emacs= file, all you need to add is

#+NAME: emacs_bootstrap
#+BEGIN_SRC emacs-lisp :tangle dot_emacs.el

;; Setup your Org directory
(setq org-directory "~/OrgFiles")

;; Loads PAF's emacs setup with bootstrap
(load-file "~/Emacs/emacs_setup.el")
#+end_src

** Bootstrap
Initially when cloning this repository, you have the =emacs_setup.org= file, that contains the config that you adapt to your specific setup, and an =emacs_setup.el= with a bootstrap content that will tangle and compile the org file, /and replace itself/. This is useful the very first time.

After that, the config itself should have the hook to re-tangle and re-compile the setup at each save.

Therefore my setup is very easy to install, and it needs these steps:

1. clone this repo into =~/Emacs=
2. add the one line in you =~/.emacs=
3. make sure Emacs re-interprets its init (you could restart it)

It may be that [[https://github.com/jwiegley/use-package][use-package]] is not installed on your setup, so it will first try to install that. After that step, it will also start installing any package that is marked as needed in this config automatically.

The original content of the =emacs_setup.el= is as follows:

#+begin_src emacs-lisp :tangle (expand-file-name "emacs_setup.el" temporary-file-directory)
;; This is the initial state of the file to be loaded.
;; It will replace itself with the actual configuration at first run.

(require 'org) ; We can't tangle without org!

(setq config_base (expand-file-name "emacs_setup"
				    (file-name-directory
				     (or load-file-name buffer-file-name))))
(find-file (concat config_base ".org"))        ; Open the configuration
(org-babel-tangle)                             ; tangle it
(load-file (concat config_base ".el"))         ; load it
(byte-compile-file (concat config_base ".el")) ; finally byte-compile it
#+end_src

** Recompile all packages
This will force-recompile everything in =~/.emacs.d/elpa/...= Just run =M-:= and then enter this:
#+begin_src emacs-lisp :tangle no
(byte-recompile-directory package-user-dir nil 'force)
#+end_src
or simply =C-x C-e= at the end of that line.

** One-time configure
To preserve the original state of this file when updating the git repos with new config settings, execute the following block once (=C-c C-c=):

*** TODO detect the system better
:LOGBOOK:
- State "TODO"       from              [2021-02-03 Wed 16:57]
:END:
currently it does not a good job of figuring out the diff between OSX, Linux, Termux (android) and Windows.

#+begin_src bash :noweb yes :tangle onetime_setup.sh
  #!/bin/bash
  # Make git ignore the tangled & updated emacs_setup.el
  if [[ -z "$(which git)" ]]; then
    echo "You will need 'git' to be installed !"
    exit 1
  fi
  if  [[ -z "$(which emacs)" ]]; then
    echo "You might need 'emacs' for this to be useful !"
    exit 1
  fi

  GIT_ROOT=$(dirname $0)
  (cd ${GIT_ROOT} && git update-index --skip-worktree emacs_setup.el)

  # Maybe this is a new install, .emacs does not exist
  test -e ~/.emacs || touch ~/.emacs

  # Initial tangle of files.
  emacs --batch --load ${GIT_ROOT}/emacs_setup.el

  # Add the load-file as the first thing in the user's ~/.emacs
  # If not yet added.
  declare lines=$(grep ';; dot_emacs.el' ~/.emacs | wc -l)
  if (( lines < 1 )); then
    echo "Added loading the config in your ~/.emacs"
    echo ";; dot_emacs.el" > ~/.emacs.new
    cat ${GIT_ROOT}/dot_emacs.el >> ~/.emacs.new
    cat ~/.emacs >> ~/.emacs.new
    mv ~/.emacs.new ~/.emacs
  else
    echo "Config in your ~/.emacs already set up!"
  fi

  # Install system dependencies
  echo "Installing dependencies"
  bash ${GIT_ROOT}/install_deps.sh

  echo "Cleanup"
  rm ${GIT_ROOT}/dot_emacs.el
  rm ${GIT_ROOT}/install_deps.sh
#+end_src

This script is then used to install the needed packages on the system.
#+begin_src bash :noweb yes :tangle install_deps.sh
  #!/bin/bash
  set -e

  # Trick to make it work on Termux
  which "ls" || pkg install debianutils

  # This is a bit of heuristics to find out what the install system is
  # They are attempted in this order, put the least likely first.
  declare -a PKG_MGRS=("pkg" "brew" "apt-get")

  PKG_PREFIX_apt_get="sudo"
  PKG_POSTFIX_apt_get="-y"

  for pkg in "${PKG_MGRS[@]}"; do
      if [[ -x "$(which ${pkg})" ]]; then
          INSTALLER="${pkg}"
          break
      fi
  done
  if [[ -z "${INSTALLER}" ]]; then
      echo "Did not find a suitable installer (tried ${PKG_MGRS[@]})"
      exit 1
  fi

  # This is the function to call to install anything. It can optionally
  # check for a binary and avoid installing if it's found.  install_pkg
  # [-x <binary>] <package>
  function install_pkg() {
      if [[ "$1" == "-x" ]]; then
          local binary="$(which $2)"
          if [[ -n "${binary}" && -x "${binary}" ]]; then
              echo "Found $2 (${binary}), nothing to install for $3."
              return
          fi
          shift 2
      fi

      local token=$(echo -n ${INSTALLER} | tr -c '0-9a-zA-Z_' '_')
      local prefix_var="PKG_PREFIX_${token}"
      local postfix_var="PKG_POSTFIX_${token}"

      echo "Trying: ${INSTALLER} install $*"
      ${!prefix_var} $(which ${INSTALLER}) ${!postfix_var} install "$@"
  }
#+end_src

* Initialize Emacs
This section sets up Emacs so it can tangle the config, find =use-package=, and find the ELPA repositories where to get the new packes from.
** Info header
Just to add a little information in the tangled file.
#+begin_src emacs-lisp
;; ===== this file was auto-tangled, only edit the emacs_setup.org =====
#+end_src

** melpa
Make sure we have the package system initialized before we load anything.
#+begin_src emacs-lisp
(require 'package)
(when (< emacs-major-version 27)
  (package-initialize))
#+end_src

Adding my choice of packages repositories.
#+NAME melpa-setup
#+begin_src emacs-lisp
(setq package-archives '(("org" . "https://orgmode.org/elpa/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("stable-melpa" . "https://stable.melpa.org/packages/")
                         ("gnu" . "https://elpa.gnu.org/packages/")
                         ; ("marmalade" . "https://marmalade-repo.org/packages/")
                        ))
#+end_src
** use-package
I use =use-package= for most configuration, and that needs to be at the top of the file.  =use-package= verifies the presence of the requested package, otherwise installs it, and presents convenient sections for configs of variables, key bindings etc. that happen only if the package is actually loaded.

First, make sure it gets installed if it is not there yet.
#+begin_src emacs-lisp
  ;; make sure use-package is installed
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)
#+end_src

#+begin_src emacs-lisp
(eval-when-compile (require 'use-package))
#+end_src
** tangle-this-config
I set this up to tangle the init org-mode file into the actual Emacs init file as soon as I save it.
#+begin_src emacs-lisp
(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are
  tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name "~/Emacs/emacs_setup.org"))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file "~/Emacs/emacs_setup.el"))))

(add-hook 'after-save-hook 'tangle-init)
#+end_src
** Detect System
Some hints about how to do this are [[http://ergoemacs.org/emacs/elisp_determine_OS_version.html][here]].

#+begin_src emacs-lisp
;; Detect the current system and capabilities
#+end_src
* Personal Initialization
** Clear =C-p= so I can use it as a prefix
Remove =C-p= that I want to use for *me* personally as a prefix.
#+begin_src emacs-lisp
(global-set-key (kbd "C-p") nil) ;; was 'previous-line'
#+end_src
** Initial scratch content
#+begin_src emacs-lisp
(setq initial-scratch-message "; Paf's unsaved ramblings and tests...\n")
#+end_src
** Splash screen
#+begin_src emacs-lisp
  (setq initial-buffer-choice "~/Emacs/welcome.org")
  (setq fancy-splash-image "~/Emacs/paf_emacs.svg")
  (setq org-startup-with-inline-images t)
#+end_src


* Helper Functions
** add-hook-run-once
Use instead of add-hook to run it a single time.
[[https://emacs.stackexchange.com/questions/3323/is-there-any-way-to-run-a-hook-function-only-once][found here]]
#+begin_src emacs-lisp
(defmacro add-hook-run-once (hook function &optional append local)
  "Like add-hook, but remove the hook after it is called"
  (let ((sym (make-symbol "#once")))
    `(progn
       (defun ,sym ()
         (remove-hook ,hook ',sym ,local)
         (funcall ,function))
       (add-hook ,hook ',sym ,append ,local))))
#+end_src

** truncate a string
#+begin_src emacs-lisp
  ;; This one provides a version with custom ellipsis.
  (use-package s
    :ensure t)

  (defun paf/truncate-string (text &optional len)
    "Truncate the text to a given length.

  When LEN is a number, resulting string is truncated at that length.
  If the length is bigger, then '...' is added at the end.

  Usage example:

    (setq org-agenda-prefix-format
          '((agenda . \" %(paf/truncate-string (roam-extras/extract-agenda-category) 12) %?-12t %12s\")))

  Refer to `org-agenda-prefix-format' for more information."
    (interactive)
    (if (numberp len)
        (s-truncate len text org-ellipsis) ;; "…")
      text))
#+end_src
* Environment
** Browser default
#+begin_src emacs-lisp
(setq browse-url-generic-program (executable-find "google-chrome")
  browse-url-browser-function 'browse-url-generic)
#+end_src
** Setup server
Start the background server, so we can use emacsclient.
#+begin_src emacs-lisp :tangle no
(server-start)
#+end_src
** UTF-8
 Make Emacs request UTF-8 first when pasting stuff.
#+begin_src emacs-lisp
(use-package unicode-escape
  :ensure t
  :init
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
(set-language-environment "UTF-8")
#+end_src
** Newline (only Unix wanted)
This should automatically convert any files with dos or Mac line endings into Unix style ones. Code found [[https://www.emacswiki.org/emacs/EndOfLineTips][here]].
#+begin_src emacs-lisp
  (defun no-junk-please-we-are-unixish ()
    (let ((coding-str (symbol-name buffer-file-coding-system)))
      (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
        (set-buffer-file-coding-system 'unix))))

  (add-hook 'find-file-hook 'no-junk-please-we-are-unixish)
#+end_src
** auto revert
Use =auto-revert=, which reloads a file if it's updated on disk
and not modified in the buffer.
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src

** enable upcase- and downcase-region and narrowing
these got diabled in Emacs 19 (!) because they were considered confusing.
Use =C-x C-u= and =C-x C-l= to effect them.

#+begin_src emacs-lisp
  (put 'upcase-region 'disabled nil)  ;; C-x C-u
  (put 'downcase-region 'disabled nil)  ;; C-x C-l (lowercase L)

  ;; C-x n <key>. Widen with C-x n w
  (put 'narrow-to-region 'disabled nil)  ; C-x n n
  (put 'narrow-to-defun  'disabled nil)
  (put 'narrow-to-page   'disabled nil)
#+end_src

** Calendar starts on Monday
#+begin_src emacs-lisp
  ;; Calendar starts on Monday
  (setq calendar-week-start-day 1)
#+end_src

* Managing Buffers
** winner-mode (layout managing)
Enables =winner-mode=. Navigate buffer-window configs with =C-c left= and =C-c right=.
#+begin_src emacs-lisp
(winner-mode 1)
#+end_src

** eyebrowse (layout managing)
This is supposed to be a better window manager.
#+begin_src emacs-lisp
(use-package eyebrowse
  :ensure t)
#+end_src

** toggle-maximize-buffer
Temporarily maximize a buffer.
[[https://gist.github.com/mads379/3402786][found here]]
#+begin_src emacs-lisp
(defun toggle-maximize-buffer () "Maximize buffer"
  (interactive)
  (if (= 1 (length (window-list)))
      (jump-to-register '_)
    (progn
      (window-configuration-to-register '_)
      (delete-other-windows))))
#+end_src

Map it to a key.
#+begin_src emacs-lisp
(global-set-key [M-f8] 'toggle-maximize-buffer)
#+end_src
* Colors and Look
** Fontlock
This gets the font coloring switched on for all buffers.
*** TODO Note: this should be the default, maybe this can go ?
:LOGBOOK:
- State "TODO"       from              [2018-11-07 Wed 22:29]
:END:
#+begin_src emacs-lisp
(global-font-lock-mode t)
#+end_src
** In terminal mode
#+begin_src emacs-lisp
(when (display-graphic-p)
  (set-background-color "#ffffff")
  (set-foreground-color "#141312"))
#+end_src
** In X11 mode: mouse and window title
#+begin_src emacs-lisp
(setq frame-title-format "emacs @ %b - %f")
(when window-system
  (mouse-wheel-mode)  ;; enable wheelmouse support by default
  (set-selection-coding-system 'compound-text-with-extensions))
#+end_src
** Look: buffer naming
#+begin_src emacs-lisp
(use-package uniquify
  :init
  (setq uniquify-buffer-name-style 'post-forward-angle-brackets))
#+end_src
** Buffer Decorations
Setup the visual cues about the current editing buffer
#+begin_src emacs-lisp
(column-number-mode t)
(setq visible-bell t)
(setq scroll-step 1)
(setq-default transient-mark-mode t)  ;; highlight selection
#+end_src
** nyan-mode
#+begin_src emacs-lisp
(use-package nyan-mode
  :ensure t
  :bind ("C-p n" . 'nyan-mode))
#+end_src
** dynamic cursor colors
The cursor is displayed in different colors, depending on overwrite or insert mode.
#+begin_src emacs-lisp
(setq hcz-set-cursor-color-color "")
(setq hcz-set-cursor-color-buffer "")

(defun hcz-set-cursor-color-according-to-mode ()
  "change cursor color according to some minor modes."
  ;; set-cursor-color is somewhat costly, so we only call it when needed:
  (let ((color
         (if buffer-read-only "orange"
           (if overwrite-mode "red"
             "green"))))
    (unless (and
             (string= color hcz-set-cursor-color-color)
             (string= (buffer-name) hcz-set-cursor-color-buffer))
      (set-cursor-color (setq hcz-set-cursor-color-color color))
      (setq hcz-set-cursor-color-buffer (buffer-name)))))

(add-hook 'post-command-hook 'hcz-set-cursor-color-according-to-mode)
#+end_src
