dot_emacs.el
;; Loads PAF's emacs setup with bootstrap
(load-file "~/Emacs/emacs_setup.el")
