emacs_setup.org
** theme / faces
I really like the high-contract Zenburn theme.
#+begin_src emacs-lisp
  (use-package hc-zenburn-theme
    :ensure t)

  ;; This makes some of the faces a bit more contrasted.
  ;; faces for general region highlighting zenburn is too low-key.
  (custom-set-faces
   '(highlight ((t (:background "forest green"))))
   '(region ((t (:background "forest green")))))
#+end_src
** delight
Package to remove some info from the mode-line for minor-modes.
#+begin_src emacs-lisp
  (use-package delight
    :ensure t)
#+end_src
** remove some modelines
#+begin_src emacs-lisp
  (use-package eldoc
    :delight)
#+end_src
* Key Mappings
** alternate key mappings
Letting one enter chars that are otherwise difficult in e.g. the minibuffer.
#+begin_src emacs-lisp
(global-set-key (kbd "C-m") 'newline-and-indent)
(global-set-key (kbd "C-j") 'newline)
(global-set-key [delete] 'delete-char)
(global-set-key [kp-delete] 'delete-char)
#+end_src
** home and end
#+begin_src emacs-lisp
  (global-set-key (kbd "<home>") 'beginning-of-line)
  (global-set-key (kbd "<end>") 'end-of-line)
#+end_src
** Macros
#+begin_src emacs-lisp
(global-set-key [f3] 'start-kbd-macro)
(global-set-key [f4] 'end-kbd-macro)
(global-set-key [f5] 'call-last-kbd-macro)
#+end_src
** Text size
Increase/decrease text size
#+begin_src emacs-lisp
(define-key global-map (kbd "C-+") 'text-scale-increase)
(define-key global-map (kbd "C--") 'text-scale-decrease)
#+end_src
** multiple regions
#+begin_src emacs-lisp
(global-set-key (kbd "C-M-i") 'iedit-mode)
#+end_src
** Moving around buffers
#+begin_src emacs-lisp
(global-set-key (kbd "C-c <C-left>")  'windmove-left)
(global-set-key (kbd "C-c <C-right>") 'windmove-right)
(global-set-key (kbd "C-c <C-up>")    'windmove-up)
(global-set-key (kbd "C-c <C-down>")  'windmove-down)
(global-set-key (kbd "C-c C-g") 'goto-line)
#+end_src
** multiple-cursors
Configure the shortcuts for multiple cursors
#+begin_src emacs-lisp
(use-package multiple-cursors
  :ensure t
  :bind (("C-S-c C-S-c" . 'mc/edit-lines)
         ("C->" . 'mc/mark-next-like-this)
         ("C-<" . 'mc/mark-previous-like-this)
         ("C-c C->" . 'mc/mark-all-like-this)))
#+end_src
** ace-jump-mode
Let's one jump around text
#+begin_src emacs-lisp
(use-package ace-jump-mode
  :ensure t
  :bind (("C-c C-SPC" . 'ace-jump-mode)
         ("C-c C-DEL" . 'ace-jump-mode-pop-mark)))
#+end_src
** Hydra
#+begin_src emacs-lisp
  (use-package hydra
    :ensure t)
#+end_src
* Editing Style
** No tabs, ever. No trailing spaces either.
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq require-final-newline t)
(setq next-line-add-newlines nil)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src
** Mark the 80 cols boundary
#+begin_src emacs-lisp
  (use-package column-enforce-mode
    :ensure t
    :config
    (setq column-enforce-column 80)
    :bind ("C-c m" . 'column-enforce-mode))
  ;; column-enforce-face
#+end_src
** Better kill ring
Seen demonstrated by [[https://www.youtube.com/watch?v=LFXA089Tx38][Uncle Dave]]
#+begin_src emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))
#+end_src
* Cool Packages
** annotate-mode
The file-annotations are store externally. Seems to fail with =args-out-of-range= and then Emacs is confused. (filed issue for this)

Also, it seems to interfere with colorful modes like =magit= or =org-agenda-mode= so that I went with a whitelist instead of the wish of a blacklist of modes.

#+begin_src emacs-lisp
(use-package annotate
  :ensure t
  :bind ("C-c C-A" . 'annotate-annotate)  ;; for ledger-mode, as 'C-c C-a' is taken there.
  :config
  (add-hook 'org-mode 'annotate-mode)
  (add-hook 'csv-mode 'annotate-mode)
  (add-hook 'c-mode 'annotate-mode)
  (add-hook 'c++-mode 'annotate-mode)
  (add-hook 'sh-mode 'annotate-mode)
  (add-hook 'ledger-mode 'annotate-mode)
;;;  (define-globalized-minor-mode global-annotate-mode annotate-mode
;;;    (lambda () (annotate-mode 1)))
;;;  (global-annotate-mode 1)
  )
#+end_src

** web-mode
web-mode with config for Polymer editing
#+begin_src emacs-lisp
(use-package web-mode
  :ensure t
  :mode "\\.html\\'"
  :config
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2))
#+end_src
** typescript-mode
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 2))
#+end_src

** csv-mode
mode to edit CSV files.
#+begin_src emacs-lisp
  (use-package csv-mode
    :ensure t
    :mode "\\.csv\\'")
#+end_src
** protobuf-mode
Mode for Google protocol buffer mode
#+begin_src emacs-lisp
  (use-package protobuf-mode
    :ensure t
    :mode "\\.proto\\'")
#+end_src
** Helm (list completion)
Trying out Helm instead of icicles, as it is available on ELPA.

I just took over the config described in this [[https://tuhdo.github.io/helm-intro.html][helm intro]].

#+begin_src emacs-lisp
  (use-package helm
   :ensure t
   :delight helm-mode
   :config
    (require 'helm-config)
    ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
    ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
    ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
    (global-set-key (kbd "C-c h") 'helm-command-prefix)
    (global-unset-key (kbd "C-x c"))

    (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
    (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB work in terminal
    (define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z

    (when (executable-find "curl")
      (setq helm-google-suggest-use-curl-p t))

    (setq helm-split-window-inside-p            t ; open helm buffer inside current window, not occupy whole other window
          helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
          helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
          helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
          helm-ff-file-name-history-use-recentf t
          helm-echo-input-in-header-line t)

    (setq helm-autoresize-max-height 0)
    (setq helm-autoresize-min-height 20)
    (helm-autoresize-mode 1)

    (helm-mode 1)

    (global-set-key (kbd "M-x") 'helm-M-x))
#+end_src

#+begin_src emacs-lisp :tangle no
(defun spacemacs//helm-hide-minibuffer-maybe ()
  "Hide minibuffer in Helm session if we use the header line as input field."
  (when (with-helm-buffer helm-echo-input-in-header-line)
    (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
      (overlay-put ov 'window (selected-window))
      (overlay-put ov 'face
                   (let ((bg-color (face-background 'default nil)))
                     `(:background ,bg-color :foreground ,bg-color)))
      (setq-local cursor-type nil))))


(add-hook 'helm-minibuffer-set-up-hook
          'spacemacs//helm-hide-minibuffer-maybe)
#+end_src

** [[https://github.com/smihica/emmet-mode][emmet-mode]]
Useful abbreviations when coding in HTML.
#+begin_src emacs-lisp
(use-package emmet-mode
:ensure t)
#+end_src
** rainbow-mode
Colorize color names and codes in the correct color.
#+begin_src emacs-lisp
(use-package rainbow-mode
:ensure t)
#+end_src
** taskjuggler-mode (tj3-mode)
#+begin_src emacs-lisp
  ;; ox-taskjuggler is in here somewhere...
  (use-package org-plus-contrib
    :ensure t)

  (use-package tj3-mode
    :ensure t
    :after org-plus-contrib
    :config
    (require 'ox-taskjuggler)
    (custom-set-variables
     '(org-taskjuggler-process-command "/usr/bin/tj3 --silent --no-color --output-dir %o %f")
     '(org-taskjuggler-project-tag "PRJ")))
#+end_src

#+begin_src bash :tangle install_deps.sh
# Install TaskJuggler
  if [[ "$(uname -m)" == "x86_64" ]]; then
    install_pkg tj3
  fi
#+end_src

** writeroom-mode
#+begin_src emacs-lisp
(use-package writeroom-mode
  :ensure t
  :init
  (global-set-key (kbd "C-p w") 'writeroom-mode))
#+end_src

** wgrep-mode
#+begin_src emacs-lisp
(use-package wgrep
  :ensure t)
#+end_src

** [[https://github.com/ledger/ledger-mode][ledger-mode]]
*** Cleanup ledger file
#+begin_src emacs-lisp
(defun single-lines-only ()
  "replace multiple blank lines with a single one"
  (interactive)
  (goto-char (point-min))
  (while (re-search-forward "\\(^\\s-*$\\)\n" nil t)
    (replace-match "\n")
    (forward-char 1)))

(defun paf/cleanup-ledger-buffer ()
  "Cleanup the ledger file"
  (interactive)
  (delete-trailing-whitespace)
  (single-lines-only)
  (ledger-mode-clean-buffer)
  (ledger-sort-buffer))
#+end_src
*** Compute formatted sum of region
It actually computes the entire arithmetic expression that is selected, and replaces it with the numerical result.
#+begin_src emacs-lisp
  (defun apply-function-to-region (fn)
    (interactive "XFunction to apply to region: ")
    (save-excursion
      (let* ((beg (region-beginning))
             (end (region-end))
             (had-region (use-region-p))
             (resulting-text
              (funcall
               fn
               (buffer-substring-no-properties beg end)))
             (new-end (+ beg (length resulting-text))))
        (kill-region beg end)
        (insert resulting-text)
        ;; set the active region again if it was set originally.
        (if had-region
            (progn
              (goto-char beg)
              (push-mark new-end)
              (setq mark-active t))))))

  (defun paf/sum-amount (expression)
    "Computes the sum from the arith expression given as argument."
    (format "%.2f" (string-to-number (calc-eval expression))))

  (defun paf/sum-amount-of-region ()
    "Takes the region as an arithmetic expr, and replaces it with its sum."
    (interactive)
    (if (use-region-p)
        (progn
          (apply-function-to-region 'paf/sum-amount)
          (goto-char (region-end)))))

  (global-set-key (kbd "C-p S") 'paf/sum-amount-of-region)
#+end_src
*** Setup
#+begin_src emacs-lisp
  (use-package ledger-mode
    :ensure t
    :bind ("<f6>" . 'paf/cleanup-ledger-buffer)
    :config
    (setq ledger-reconcile-default-commodity "CHF")
    :init
    (add-hook 'ledger-mode-hook
              (lambda ()
                (setq-local tab-always-indent 'complete)
                (setq-local completion-cycle-threshold t)
                (setq-local ledger-complete-in-steps t))))
#+end_src
** [[http://www.gnu.org/software/hyperbole/][hyperbole]]
I found some gems that explain a bit better what hyperbole is trying to solve. See John Wiegley's [[https://www.reddit.com/r/emacs/comments/7daneo/announce_gnu_hyperbole_7_aka_the_git_ready_for/dpx5sxw/][Using hyperbole: a motivation]]
Once more it shows that the most powerful things are not always the most visible.

*NOTE* assigns =hui-search-web= to =C-c C-/= to not clobber the later used =C-c /= from OrgMode (org-mode sparse trees). This works because hyperbole will first check if the function is already bound to some key before binding it to the coded default.
#+begin_src emacs-lisp
  (use-package hyperbole
    :ensure t
    :config
    (bind-key "C-c C-/" 'hui-search-web)  ;; bind before calling require
    (require 'hyperbole))
#+end_src
** [[https://github.com/fourier/ztree#ztree][ztree]]
A tree-view navigation of files, with diff tool for directories.
#+begin_src emacs-lisp :tangle no
  (use-package ztree
    :ensure t)
#+end_src
** Emacs Application Framework
Tried it, but it fails often. too fiddly.
#+begin_src emacs-lisp :tangle no
  (if (string-equal system-type "gnu/linux")
      (use-package eaf
        :load-path "~/.emacs.d/site-lisp/emacs-application-framework"
        :custom
        (eaf-find-alternate-file-in-dired t)
        :config
        (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
        (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
        (eaf-bind-key take_photo "p" eaf-camera-keybinding)))
#+end_src

#+begin_src bash :tangle install_deps.sh
  if [[ $(uname -m) == 'x86_64' ]]; then
    # Get the application framework
    install_pkg -x git git
    LISPDIR="${HOME}/.emacs.d/site-lisp"
    REPOS="https://github.com/manateelazycat/emacs-application-framework.git"
    [[ -d "${LISPDIR}" ]] || mkdir -p "${LISPDIR}"
    # try initial checkout if not dir yet
    (cd "${LISPDIR}" && [[ -d "emacs-application-framework" ]] || git clone "${REPOS}" --depth=1)
    # otherwise try to update the framework
    (cd "${LISPDIR}/emacs-application-framework" && git pull --rebase)
    # Install dependencies
    install_pkg nodejs
    install_pkg python3-pyqt5
    install_pkg python3-pyqt5.qtwebengine
    install_pkg python3-dbus
    install_pkg wmctrl
    # Install some needed Python packages
    install_pkg -x /usr/bin/pip3 python3-pip
    /usr/bin/pip3 install pymupdf qrcode pynotify qtconsole
  fi
#+end_src

#+begin_src bash :tangle install_deps.sh
  cat >> "${HOME}/.profile" <<EOF

  # Emacs Application Framework:
  # Make sure D-Bus is getting started when logging in.
  ## Test for an existing bus daemon, just to be safe
  if test -z "\$DBUS_SESSION_BUS_ADDRESS" ; then
      ## if not found, launch a new one
      eval \`dbus-launch --sh-syntax --exit-with-session\`
      echo "D-Bus per-session daemon address is: \$DBUS_SESSION_BUS_ADDRESS"
  fi
  EOF
#+end_src

* Coding
** VCS
*** magit
Add the powerful Magit
#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :defer
    :bind ("C-x g" . 'magit-status))
  (use-package magit-todos
    :ensure t
    :defer)
#+end_src
*** monky
Add the Magit-copy for Mercurial 'monky'
#+begin_src emacs-lisp
  (use-package monky
    :ensure t
    :defer
    :bind ("C-x m" . 'monky-status))
#+end_src
*** Global caller
Have a single binding to call the most appropriate tool given the repository.
#+begin_src emacs-lisp
  (defun paf/vcs-status ()
       (interactive)
       (condition-case nil
           (magit-status-setup-buffer)
         (error (monky-status))))

  (global-set-key (kbd "C-p v") 'paf/vcs-status)
#+end_src

** Projectile
Start using projectile. It has the documentation [[https://docs.projectile.mx/en/latest/][here]].
#+begin_src emacs-lisp
  (defun paf/projectile-relative-buf-name ()
    (ignore-errors
      (rename-buffer
       (file-relative-name buffer-file-name (projectile-project-root)))))

  (use-package projectile
    :ensure t
    :config
    (projectile-mode 1)
    (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
    (add-hook 'find-file-hook 'paf/projectile-relative-buf-name))

  (use-package helm-projectile
    :ensure t
    :after projectile
    :requires projectile
    :delight projectile-mode
    :config
    (helm-projectile-on))
#+end_src

Also make sure we do have the faster [[https://github.com/ggreer/the_silver_searcher#the-silver-searcher][silver searcher]] version.  This may need you to install the corresponding tool for this, with the following snippet:
#+begin_src bash :tangle install_deps.sh
# helm-ag uses this for faster grepping
if [[ "$(uname)" == "Darwin" ]]; then
  install_pkg -x ag the_silver_searcher
else
  install_pkg -x ag silversearcher-ag
fi
#+end_src

Search the entire project with =C-c p s s= for a regexp. This let's you turn the matching results into an editable buffer using =C-c C-e=. Other keys are listed [[https://github.com/syohex/emacs-helm-ag#keymap][here]].

#+begin_src emacs-lisp
  (use-package ag
    :ensure t)

  (use-package helm-ag
    :ensure t)
#+end_src
