emacs_setup.org
**** text formatting
These are some improved rendering of the calendar view.

First, d12frosted's [[https://d12frosted.io/posts/2020-06-24-task-management-with-roam-vol2.html][post]] handles the category length:
#+begin_src emacs-lisp
  (defun paf/agenda-category (len)
    (paf/truncate-string (roam-extras/extract-agenda-category) len))

  (with-eval-after-load 'org-agenda
    (setq org-agenda-prefix-format
          '((agenda . " %i %-12(paf/agenda-category 12) %?-12t% s")
            (todo . " %i %-12(paf/agenda-category 12) ")
            (tags . " %i %-12(paf/agenda-category 12) ")
            (search . " %i %-12(paf/agenda-category 12) "))))
#+end_src

Displaying a grid of 3 hours seems better, as show by AbstProcDo's [[https://www.reddit.com/r/orgmode/comments/mbs4ia/my_agendatime_grid_segmented_by_3_hours/][post]]:
#+begin_src emacs-lisp
  (setq org-agenda-time-grid
        (quote ((daily today remove-match)
                (600 900 1200 1500 1800 2100)
                " ……………"
                "" ;; ———————————————"
                )))
#+end_src

**** delight
#+begin_src emacs-lisp
(delight 'org-agenda-mode)
#+end_src
**** colors and faces
Make the calendar day info a bit more visible and contrasted.
#+begin_src emacs-lisp
;; Faces to make the calendar more colorful.
(custom-set-faces
 '(org-agenda-current-time ((t (:inherit org-time-grid :foreground "yellow" :weight bold))))
 '(org-agenda-date ((t (:inherit org-agenda-structure :background "pale green" :foreground "black" :weight bold))))
 '(org-agenda-date-weekend ((t (:inherit org-agenda-date :background "light blue" :weight bold)))))
#+end_src
**** now marker
A more visible current-time marker in the agenda
#+begin_src emacs-lisp
(setq org-agenda-current-time-string ">>>>>>>>>> NOW <<<<<<<<<<")
#+end_src
**** auto-refresh
#+begin_src emacs-lisp
  ;; will refresh it only if already visible
  (run-at-time nil 180 'kiwon/org-agenda-redo-if-visible)
#+end_src

**** auto-save org files when idle
This will save them regularly when the idle for more than a minute.
#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook
    (lambda () (run-with-idle-timer 600 t 'org-save-all-org-buffers)))
#+end_src
**** export
That's the export function to update the agenda view.
#+begin_src emacs-lisp :tangle no
(setq org-agenda-exporter-settings
      '((ps-number-of-columns 2)
        (ps-portrait-mode t)
        (org-agenda-add-entry-text-maxlines 5)
        (htmlize-output-type 'font)))

(defun dmg-org-update-agenda-file (&optional force)
  (interactive)
  (save-excursion
    (save-window-excursion
      (let ((file "~/www/agenda/agenda.html"))
        (org-agenda-list)
        (org-agenda-write file)))))
#+end_src
*** org-duration
#+begin_src emacs-lisp
  (use-package org-duration
    :config
    (setq org-duration-units
          `(("min" . 1)
            ("h" . 60)
            ("d" . ,(* 60 8))
            ("w" . ,(* 60 8 5))
            ("m" . ,(* 60 8 5 4))
            ("y" . ,(* 60 8 5 4 10)))
          )
    (org-duration-set-regexps))
#+end_src
*** Capture & refile
Capture and refile stuff, with some templates that I think are useful.

Very nice post on how to get capture templats from a file: [[https://joshrollinswrites.com/help-desk-head-desk/org-capture-in-files/][Org-capture in Files]].

#+begin_src emacs-lisp
  (setq org-default-notes-file (org-relative-file "Inbox.org"))

  (setq org-capture-templates
        `(("t" "Task"
           entry (file+headline ,(org-relative-file "Inbox.org") "Tasks")
           "* TODO %?\n%U\n\n%x"
           :clock-resume t)
          ;;
          ("i" "Idea"
           entry (file+headline ,(org-relative-file "Inbox.org") "Ideas")
           "* SOMEDAY %?\n%U\n\n%x"
           :clock-resume t)
          ;;
          ("m" "Meeting"
           entry (file+headline ,(org-relative-file "Inbox.org") "Meetings")
           "* %?  :MTG:\n%U\n%^{with}p"
           :clock-in t
           :clock-resume t)
          ;;
          ("s" "Stand-up"
           entry (file+headline ,(org-relative-file "Inbox.org") "Meetings")
           "* Stand-up  :MTG:\n%U\n\n%?"
           :clock-in t
           :clock-resume t)
          ;;
          ("1" "1:1"
           entry (file+headline ,(org-relative-file "Inbox.org") "Meetings")
           "* 1:1 %^{With}  :MTG:\n%U\n:PROPERTIES:\n:with: %\\1\n:END:\n\n%?"
           :clock-in t
           :clock-resume t)
          ;;
          ("p" "Talking Point"
           entry (file+headline ,(org-relative-file "refile.org") "Talking Points")
           "* %?  :TALK:\n%U\n%^{dowith}p"
           :clock-keep t)
          ;;
          ("j" "Journal"
           entry (file+olp+datetree ,(org-relative-file "journal.org"))
           "* %?\n%U"
           :clock-in t
           :clock-resume t
           :kill-buffer t)))

  ;; show up to 2 levels for refile targets, in all agenda files
  (setq org-refile-targets '((org-agenda-files . (:maxlevel . 2))))
  (setq org-log-refile t)  ;; will add timestamp when refiled.

  ;; from: http://doc.norang.ca/org-mode.html
  ;; Exclude DONE state tasks from refile targets
  (defun bh/verify-refile-target ()
    "Exclude todo keywords with a done state from refile targets"
    (not (member (nth 2 (org-heading-components)) org-done-keywords)))

  (setq org-refile-target-verify-function 'bh/verify-refile-target)
#+end_src
*** OrgRoam templates
#+begin_src emacs-lisp
  (setq org-roam-capture-templates
        `(("m" "Meeting" entry (function org-roam--capture-get-point)
           "* %?\n%U\n%^{with}\n"
           :file-name "Meeting/%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+roam_tags: %^{with}\n\n"
           )
          ("n" "Note" entry (function org-roam--capture-get-point)
           "* %?"
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+roam_tags: draft\n\n"
           )
          ("r" "Reference" entry (function org-roam--capture-get-point)
           "* %?\n%U\n\n"
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :head "#+title: ${title}\n#+roam_tags: reference\n\n"
           )))
#+end_src
*** org-babel
What kind of code block languages do I need
#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate 'nil) ; Don't ask before executing

(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (R . t)
   (dot . t)
   (emacs-lisp . t)
   (gnuplot . t)
   (python . t)
   (ledger . t)
   ;;(sh . t)
   (latex . t)
   (shell . t)
  ))
#+end_src
*** org-export
Add a few formats to the export functionality of org-mode.

#+begin_src emacs-lisp
  (use-package ox-odt
    :defer)
  (use-package ox-taskjuggler
    :defer)
  (use-package ox-impress-js
    :defer)
#+end_src
*** plant-uml
Tell where PlantUML is to be found. This needs to be downloaded and installed separately, see the [[http://plantuml.com/][PlantUML website]].

You could install the PlantUML JAR file with this snippet:
#+begin_src bash :tangle install_deps.sh
  # Get a version of the PlantUML jar file.
  install_pkg -x wget wget

  URL='http://sourceforge.net/projects/plantuml/files/plantuml.jar/download'
  DIR="${HOME}/Apps"
  if [[ ! -e "${DIR}/plantuml.jar" ]]; then
      [[ -d "${DIR}" ]] || mkdir -p "${DIR}"
      (cd "${DIR}" && wget -O plantuml.jar "${URL}")
      ls -l "${DIR}/plantuml.jar"
  fi
#+end_src

#+RESULTS:
: -rw-r--r--  1 fleury  primarygroup  178 Jun 14 14:22 /Users/fleury/Apps/plantuml.jar

#+begin_src emacs-lisp
(use-package plantuml-mode
 :ensure t
 :config
  (setq plantuml-jar-path "~/Apps/plantuml.jar")
  (setq org-plantuml-jar-path "~/Apps/plantuml.jar")
  ;; Let us edit PlantUML snippets in plantuml-mode within orgmode
  (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
  ;; make it load this language (for export ?)
  (org-babel-do-load-languages 'org-babel-load-languages '((plantuml . t)))
  ;; Enable plantuml-mode for PlantUML files
  (add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode)))
#+end_src

*** PDF-Tools
A bit difficult to find the docs of how to use it, but it seems quite useful.

Disabled, as it causes only trouble to me, and I am not really using it anyway.
#+begin_src emacs-lisp :tangle no
  (use-package pdf-tools
    :if (and (eq system-type 'gnu/linux)  ;; Set it up on Linux
             (not (string-prefix-p "aarch64" system-configuration)))  ;; but not mobile devices
    :pin manual  ;; update only manually
    :config
    ;; initialize
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-page)           ;; Fit to page when opening
    (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))  ;; turn off cua so copy works
    (setq pdf-view-resize-factor 1.1)                        ;; more fine-grained zoom control
    ;; keyboard shortcuts
    (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
    (define-key pdf-view-mode-map (kbd "t") 'pdf-annot-add-text-annotation)
    (define-key pdf-view-mode-map (kbd "D") 'pdf-annot-delete))

  (use-package org-pdfview
    :after (pdf-tools)
    :init
    (add-to-list 'org-file-apps '("\\.pdf\\'" . org-pdfview-open))
    (add-to-list 'org-file-apps '("\\.pdf::\\([[:digit:]]+\\)\\'" . org-pdfview-open)))
#+end_src

#+begin_src bash :tangle no :var dummy=install_deps.sh
# For all the native apps related to PDF tools
# I did not sintall it on Max OSX yet.
if [[ "$(uname -m)" == "x86_64" ]]; then
  install_pkg elpa-pdf-tools elpa-pdf-tools-server
fi
#+end_src

*** yankpad
Check out the [[https://kungsgeten.github.io/yankpad.html][blog post]] (and the [[https://kungsgeten.github.io/yankpad13.html][follow-up]]) and the [[https://github.com/Kungsgeten/yankpad][package docs]].
#+begin_src emacs-lisp
  (use-package yankpad
    :ensure t
    :defer
    :init
    (setq yankpad-file (org-relative-file "Templates/yankpad.org"))
    :config
    (bind-key "C-p y m" 'yankpad-map)
    (bind-key "C-p y e" 'yankpad-expand))
#+end_src

*** [[https://www.eliasstorms.net/zetteldeft/][Zetteldeft]]
This is a note-taking packages inspired by the principles of the [[https://zettelkasten.de/][Zettelkasten]]
#+begin_src emacs-lisp
  (use-package deft
    :ensure t)
  (use-package avy
    :ensure t)

  (use-package zetteldeft
    :ensure t
    :after (org deft avy)

    :config
    (setq deft-extensions '("org" "md" "txt"))
    (setq deft-directory (org-relative-file "Zettelkasten"))
    (setq deft-recursive t)

    :bind (("C-c z d" . deft)
           ("C-c z D" . zetteldeft-deft-new-search)
           ("C-c z R" . deft-refresh)
           ("C-c z s" . zetteldeft-search-at-point)
           ("C-c z c" . zetteldeft-search-current-id)
           ("C-c z f" . zetteldeft-follow-link)
           ("C-c z F" . zetteldeft-avy-file-search-ace-window)
           ("C-c z l" . zetteldeft-avy-link-search)
           ("C-c z t" . zetteldeft-avy-tag-search)
           ("C-c z T" . zetteldeft-tag-buffer)
           ("C-c z i" . zetteldeft-find-file-id-insert)
           ("C-c z I" . zetteldeft-find-file-full-title-insert)
           ("C-c z o" . zetteldeft-find-file)
           ("C-c z n" . zetteldeft-new-file)
           ("C-c z N" . zetteldeft-new-file-and-link)
           ("C-c z r" . zetteldeft-file-rename))
  )
#+end_src

Update the version by downloading the latest version here:

#+begin_src bash :tangle no
wget https://raw.githubusercontent.com/EFLS/zetteldeft/master/zetteldeft.el -O ~/Emacs/zetteldeft.el
#+end_src
